loadtest/tmp-prod-250vu-gzip/summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6-browse.js
        output: -

     scenarios: (100.00%) 1 scenario, 250 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 250 looping VUs for 3m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 004/250 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 004/250 VUs  0m00.9s/3m30.0s

running (0m01.9s), 008/250 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 008/250 VUs  0m01.9s/3m30.0s

running (0m02.9s), 013/250 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 013/250 VUs  0m02.9s/3m30.0s

running (0m03.9s), 017/250 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 017/250 VUs  0m03.9s/3m30.0s

running (0m04.9s), 021/250 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 021/250 VUs  0m04.9s/3m30.0s

running (0m05.9s), 025/250 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 025/250 VUs  0m05.9s/3m30.0s

running (0m06.9s), 029/250 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 029/250 VUs  0m06.9s/3m30.0s

running (0m07.9s), 033/250 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 033/250 VUs  0m07.9s/3m30.0s

running (0m08.9s), 038/250 VUs, 4 complete and 0 interrupted iterations
default   [   4% ] 038/250 VUs  0m08.9s/3m30.0s

running (0m09.9s), 042/250 VUs, 7 complete and 0 interrupted iterations
default   [   5% ] 042/250 VUs  0m09.9s/3m30.0s

running (0m10.9s), 046/250 VUs, 8 complete and 0 interrupted iterations
default   [   5% ] 046/250 VUs  0m10.9s/3m30.0s

running (0m11.9s), 050/250 VUs, 14 complete and 0 interrupted iterations
default   [   6% ] 050/250 VUs  0m11.9s/3m30.0s

running (0m12.9s), 054/250 VUs, 19 complete and 0 interrupted iterations
default   [   6% ] 054/250 VUs  0m12.9s/3m30.0s

running (0m13.9s), 058/250 VUs, 22 complete and 0 interrupted iterations
default   [   7% ] 058/250 VUs  0m13.9s/3m30.0s

running (0m14.9s), 062/250 VUs, 26 complete and 0 interrupted iterations
default   [   7% ] 062/250 VUs  0m14.9s/3m30.0s

running (0m15.9s), 067/250 VUs, 31 complete and 0 interrupted iterations
default   [   8% ] 067/250 VUs  0m15.9s/3m30.0s

running (0m16.9s), 071/250 VUs, 38 complete and 0 interrupted iterations
default   [   8% ] 071/250 VUs  0m16.9s/3m30.0s

running (0m17.9s), 075/250 VUs, 43 complete and 0 interrupted iterations
default   [   9% ] 075/250 VUs  0m17.9s/3m30.0s

running (0m18.9s), 079/250 VUs, 50 complete and 0 interrupted iterations
default   [   9% ] 079/250 VUs  0m18.9s/3m30.0s

running (0m19.9s), 083/250 VUs, 59 complete and 0 interrupted iterations
default   [   9% ] 083/250 VUs  0m19.9s/3m30.0s

running (0m20.9s), 087/250 VUs, 66 complete and 0 interrupted iterations
default   [  10% ] 087/250 VUs  0m20.9s/3m30.0s

running (0m21.9s), 092/250 VUs, 71 complete and 0 interrupted iterations
default   [  10% ] 092/250 VUs  0m21.9s/3m30.0s

running (0m22.9s), 096/250 VUs, 78 complete and 0 interrupted iterations
default   [  11% ] 096/250 VUs  0m22.9s/3m30.0s

running (0m23.9s), 100/250 VUs, 88 complete and 0 interrupted iterations
default   [  11% ] 100/250 VUs  0m23.9s/3m30.0s

running (0m24.9s), 104/250 VUs, 101 complete and 0 interrupted iterations
default   [  12% ] 104/250 VUs  0m24.9s/3m30.0s

running (0m25.9s), 108/250 VUs, 112 complete and 0 interrupted iterations
default   [  12% ] 108/250 VUs  0m25.9s/3m30.0s

running (0m26.9s), 112/250 VUs, 124 complete and 0 interrupted iterations
default   [  13% ] 112/250 VUs  0m26.9s/3m30.0s

running (0m27.9s), 116/250 VUs, 133 complete and 0 interrupted iterations
default   [  13% ] 116/250 VUs  0m27.9s/3m30.0s

running (0m28.9s), 121/250 VUs, 144 complete and 0 interrupted iterations
default   [  14% ] 121/250 VUs  0m28.9s/3m30.0s

running (0m29.9s), 125/250 VUs, 154 complete and 0 interrupted iterations
default   [  14% ] 125/250 VUs  0m29.9s/3m30.0s

running (0m30.9s), 129/250 VUs, 167 complete and 0 interrupted iterations
default   [  15% ] 129/250 VUs  0m30.9s/3m30.0s

running (0m31.9s), 133/250 VUs, 173 complete and 0 interrupted iterations
default   [  15% ] 133/250 VUs  0m31.9s/3m30.0s

running (0m32.9s), 137/250 VUs, 182 complete and 0 interrupted iterations
default   [  16% ] 137/250 VUs  0m32.9s/3m30.0s

running (0m33.9s), 141/250 VUs, 199 complete and 0 interrupted iterations
default   [  16% ] 141/250 VUs  0m33.9s/3m30.0s

running (0m34.9s), 145/250 VUs, 211 complete and 0 interrupted iterations
default   [  17% ] 145/250 VUs  0m34.9s/3m30.0s

running (0m35.9s), 150/250 VUs, 224 complete and 0 interrupted iterations
default   [  17% ] 150/250 VUs  0m35.9s/3m30.0s

running (0m36.9s), 154/250 VUs, 240 complete and 0 interrupted iterations
default   [  18% ] 154/250 VUs  0m36.9s/3m30.0s

running (0m37.9s), 158/250 VUs, 262 complete and 0 interrupted iterations
default   [  18% ] 158/250 VUs  0m37.9s/3m30.0s

running (0m38.9s), 162/250 VUs, 277 complete and 0 interrupted iterations
default   [  19% ] 162/250 VUs  0m38.9s/3m30.0s

running (0m39.9s), 166/250 VUs, 293 complete and 0 interrupted iterations
default   [  19% ] 166/250 VUs  0m39.9s/3m30.0s

running (0m40.9s), 170/250 VUs, 312 complete and 0 interrupted iterations
default   [  19% ] 170/250 VUs  0m40.9s/3m30.0s

running (0m41.9s), 175/250 VUs, 330 complete and 0 interrupted iterations
default   [  20% ] 175/250 VUs  0m41.9s/3m30.0s

running (0m42.9s), 179/250 VUs, 339 complete and 0 interrupted iterations
default   [  20% ] 179/250 VUs  0m42.9s/3m30.0s

running (0m43.9s), 183/250 VUs, 347 complete and 0 interrupted iterations
default   [  21% ] 183/250 VUs  0m43.9s/3m30.0s

running (0m44.9s), 187/250 VUs, 354 complete and 0 interrupted iterations
default   [  21% ] 187/250 VUs  0m44.9s/3m30.0s

running (0m45.9s), 191/250 VUs, 358 complete and 0 interrupted iterations
default   [  22% ] 191/250 VUs  0m45.9s/3m30.0s

running (0m46.9s), 195/250 VUs, 367 complete and 0 interrupted iterations
default   [  22% ] 195/250 VUs  0m46.9s/3m30.0s

running (0m47.9s), 199/250 VUs, 377 complete and 0 interrupted iterations
default   [  23% ] 199/250 VUs  0m47.9s/3m30.0s

running (0m48.9s), 204/250 VUs, 386 complete and 0 interrupted iterations
default   [  23% ] 204/250 VUs  0m48.9s/3m30.0s

running (0m49.9s), 208/250 VUs, 405 complete and 0 interrupted iterations
default   [  24% ] 208/250 VUs  0m49.9s/3m30.0s

running (0m50.9s), 212/250 VUs, 424 complete and 0 interrupted iterations
default   [  24% ] 212/250 VUs  0m50.9s/3m30.0s

running (0m51.9s), 216/250 VUs, 448 complete and 0 interrupted iterations
default   [  25% ] 216/250 VUs  0m51.9s/3m30.0s

running (0m52.9s), 220/250 VUs, 464 complete and 0 interrupted iterations
default   [  25% ] 220/250 VUs  0m52.9s/3m30.0s

running (0m53.9s), 224/250 VUs, 481 complete and 0 interrupted iterations
default   [  26% ] 224/250 VUs  0m53.9s/3m30.0s

running (0m54.9s), 228/250 VUs, 495 complete and 0 interrupted iterations
default   [  26% ] 228/250 VUs  0m54.9s/3m30.0s

running (0m55.9s), 233/250 VUs, 513 complete and 0 interrupted iterations
default   [  27% ] 233/250 VUs  0m55.9s/3m30.0s

running (0m56.9s), 237/250 VUs, 532 complete and 0 interrupted iterations
default   [  27% ] 237/250 VUs  0m56.9s/3m30.0s

running (0m57.9s), 241/250 VUs, 555 complete and 0 interrupted iterations
default   [  28% ] 241/250 VUs  0m57.9s/3m30.0s

running (0m58.9s), 245/250 VUs, 575 complete and 0 interrupted iterations
default   [  28% ] 245/250 VUs  0m58.9s/3m30.0s

running (0m59.9s), 249/250 VUs, 595 complete and 0 interrupted iterations
default   [  29% ] 249/250 VUs  0m59.9s/3m30.0s

running (1m00.9s), 250/250 VUs, 606 complete and 0 interrupted iterations
default   [  29% ] 250/250 VUs  1m00.9s/3m30.0s

running (1m01.9s), 250/250 VUs, 619 complete and 0 interrupted iterations
default   [  29% ] 250/250 VUs  1m01.9s/3m30.0s

running (1m02.9s), 250/250 VUs, 637 complete and 0 interrupted iterations
default   [  30% ] 250/250 VUs  1m02.9s/3m30.0s

running (1m03.9s), 250/250 VUs, 656 complete and 0 interrupted iterations
default   [  30% ] 250/250 VUs  1m03.9s/3m30.0s

running (1m04.9s), 250/250 VUs, 673 complete and 0 interrupted iterations
default   [  31% ] 250/250 VUs  1m04.9s/3m30.0s

running (1m05.9s), 250/250 VUs, 691 complete and 0 interrupted iterations
default   [  31% ] 250/250 VUs  1m05.9s/3m30.0s

running (1m06.9s), 250/250 VUs, 701 complete and 0 interrupted iterations
default   [  32% ] 250/250 VUs  1m06.9s/3m30.0s

running (1m07.9s), 250/250 VUs, 715 complete and 0 interrupted iterations
default   [  32% ] 250/250 VUs  1m07.9s/3m30.0s

running (1m08.9s), 250/250 VUs, 729 complete and 0 interrupted iterations
default   [  33% ] 250/250 VUs  1m08.9s/3m30.0s

running (1m09.9s), 250/250 VUs, 746 complete and 0 interrupted iterations
default   [  33% ] 250/250 VUs  1m09.9s/3m30.0s

running (1m10.9s), 250/250 VUs, 771 complete and 0 interrupted iterations
default   [  34% ] 250/250 VUs  1m10.9s/3m30.0s

running (1m11.9s), 250/250 VUs, 791 complete and 0 interrupted iterations
default   [  34% ] 250/250 VUs  1m11.9s/3m30.0s

running (1m12.9s), 250/250 VUs, 812 complete and 0 interrupted iterations
default   [  35% ] 250/250 VUs  1m12.9s/3m30.0s

running (1m13.9s), 250/250 VUs, 834 complete and 0 interrupted iterations
default   [  35% ] 250/250 VUs  1m13.9s/3m30.0s

running (1m14.9s), 250/250 VUs, 847 complete and 0 interrupted iterations
default   [  36% ] 250/250 VUs  1m14.9s/3m30.0s

running (1m15.9s), 250/250 VUs, 874 complete and 0 interrupted iterations
default   [  36% ] 250/250 VUs  1m15.9s/3m30.0s

running (1m16.9s), 250/250 VUs, 891 complete and 0 interrupted iterations
default   [  37% ] 250/250 VUs  1m16.9s/3m30.0s

running (1m17.9s), 250/250 VUs, 912 complete and 0 interrupted iterations
default   [  37% ] 250/250 VUs  1m17.9s/3m30.0s

running (1m18.9s), 250/250 VUs, 931 complete and 0 interrupted iterations
default   [  38% ] 250/250 VUs  1m18.9s/3m30.0s

running (1m19.9s), 250/250 VUs, 954 complete and 0 interrupted iterations
default   [  38% ] 250/250 VUs  1m19.9s/3m30.0s

running (1m20.9s), 250/250 VUs, 973 complete and 0 interrupted iterations
default   [  39% ] 250/250 VUs  1m20.9s/3m30.0s

running (1m21.9s), 250/250 VUs, 1004 complete and 0 interrupted iterations
default   [  39% ] 250/250 VUs  1m21.9s/3m30.0s

running (1m22.9s), 250/250 VUs, 1035 complete and 0 interrupted iterations
default   [  39% ] 250/250 VUs  1m22.9s/3m30.0s

running (1m23.9s), 250/250 VUs, 1057 complete and 0 interrupted iterations
default   [  40% ] 250/250 VUs  1m23.9s/3m30.0s

running (1m24.9s), 250/250 VUs, 1069 complete and 0 interrupted iterations
default   [  40% ] 250/250 VUs  1m24.9s/3m30.0s

running (1m25.9s), 250/250 VUs, 1090 complete and 0 interrupted iterations
default   [  41% ] 250/250 VUs  1m25.9s/3m30.0s

running (1m26.9s), 250/250 VUs, 1107 complete and 0 interrupted iterations
default   [  41% ] 250/250 VUs  1m26.9s/3m30.0s

running (1m27.9s), 250/250 VUs, 1129 complete and 0 interrupted iterations
default   [  42% ] 250/250 VUs  1m27.9s/3m30.0s

running (1m28.9s), 250/250 VUs, 1158 complete and 0 interrupted iterations
default   [  42% ] 250/250 VUs  1m28.9s/3m30.0s

running (1m29.9s), 250/250 VUs, 1178 complete and 0 interrupted iterations
default   [  43% ] 250/250 VUs  1m29.9s/3m30.0s

running (1m30.9s), 250/250 VUs, 1204 complete and 0 interrupted iterations
default   [  43% ] 250/250 VUs  1m30.9s/3m30.0s

running (1m31.9s), 250/250 VUs, 1233 complete and 0 interrupted iterations
default   [  44% ] 250/250 VUs  1m31.9s/3m30.0s

running (1m32.9s), 250/250 VUs, 1252 complete and 0 interrupted iterations
default   [  44% ] 250/250 VUs  1m32.9s/3m30.0s

running (1m33.9s), 250/250 VUs, 1262 complete and 0 interrupted iterations
default   [  45% ] 250/250 VUs  1m33.9s/3m30.0s

running (1m34.9s), 250/250 VUs, 1270 complete and 0 interrupted iterations
default   [  45% ] 250/250 VUs  1m34.9s/3m30.0s

running (1m35.9s), 250/250 VUs, 1279 complete and 0 interrupted iterations
default   [  46% ] 250/250 VUs  1m35.9s/3m30.0s

running (1m36.9s), 250/250 VUs, 1283 complete and 0 interrupted iterations
default   [  46% ] 250/250 VUs  1m36.9s/3m30.0s

running (1m37.9s), 250/250 VUs, 1293 complete and 0 interrupted iterations
default   [  47% ] 250/250 VUs  1m37.9s/3m30.0s

running (1m38.9s), 250/250 VUs, 1314 complete and 0 interrupted iterations
default   [  47% ] 250/250 VUs  1m38.9s/3m30.0s

running (1m39.9s), 250/250 VUs, 1337 complete and 0 interrupted iterations
default   [  48% ] 250/250 VUs  1m39.9s/3m30.0s

running (1m40.9s), 250/250 VUs, 1367 complete and 0 interrupted iterations
default   [  48% ] 250/250 VUs  1m40.9s/3m30.0s

running (1m41.9s), 250/250 VUs, 1391 complete and 0 interrupted iterations
default   [  49% ] 250/250 VUs  1m41.9s/3m30.0s

running (1m42.9s), 250/250 VUs, 1406 complete and 0 interrupted iterations
default   [  49% ] 250/250 VUs  1m42.9s/3m30.0s

running (1m43.9s), 250/250 VUs, 1423 complete and 0 interrupted iterations
default   [  49% ] 250/250 VUs  1m43.9s/3m30.0s

running (1m44.9s), 250/250 VUs, 1439 complete and 0 interrupted iterations
default   [  50% ] 250/250 VUs  1m44.9s/3m30.0s

running (1m45.9s), 250/250 VUs, 1460 complete and 0 interrupted iterations
default   [  50% ] 250/250 VUs  1m45.9s/3m30.0s

running (1m46.9s), 250/250 VUs, 1484 complete and 0 interrupted iterations
default   [  51% ] 250/250 VUs  1m46.9s/3m30.0s

running (1m47.9s), 250/250 VUs, 1505 complete and 0 interrupted iterations
default   [  51% ] 250/250 VUs  1m47.9s/3m30.0s

running (1m48.9s), 250/250 VUs, 1521 complete and 0 interrupted iterations
default   [  52% ] 250/250 VUs  1m48.9s/3m30.0s

running (1m49.9s), 250/250 VUs, 1545 complete and 0 interrupted iterations
default   [  52% ] 250/250 VUs  1m49.9s/3m30.0s

running (1m50.9s), 250/250 VUs, 1561 complete and 0 interrupted iterations
default   [  53% ] 250/250 VUs  1m50.9s/3m30.0s

running (1m51.9s), 250/250 VUs, 1578 complete and 0 interrupted iterations
default   [  53% ] 250/250 VUs  1m51.9s/3m30.0s

running (1m52.9s), 250/250 VUs, 1595 complete and 0 interrupted iterations
default   [  54% ] 250/250 VUs  1m52.9s/3m30.0s

running (1m53.9s), 250/250 VUs, 1607 complete and 0 interrupted iterations
default   [  54% ] 250/250 VUs  1m53.9s/3m30.0s

running (1m54.9s), 250/250 VUs, 1640 complete and 0 interrupted iterations
default   [  55% ] 250/250 VUs  1m54.9s/3m30.0s

running (1m55.9s), 250/250 VUs, 1665 complete and 0 interrupted iterations
default   [  55% ] 250/250 VUs  1m55.9s/3m30.0s

running (1m56.9s), 250/250 VUs, 1687 complete and 0 interrupted iterations
default   [  56% ] 250/250 VUs  1m56.9s/3m30.0s

running (1m57.9s), 250/250 VUs, 1704 complete and 0 interrupted iterations
default   [  56% ] 250/250 VUs  1m57.9s/3m30.0s

running (1m58.9s), 250/250 VUs, 1719 complete and 0 interrupted iterations
default   [  57% ] 250/250 VUs  1m58.9s/3m30.0s

running (1m59.9s), 250/250 VUs, 1731 complete and 0 interrupted iterations
default   [  57% ] 250/250 VUs  1m59.9s/3m30.0s

running (2m00.9s), 250/250 VUs, 1738 complete and 0 interrupted iterations
default   [  58% ] 250/250 VUs  2m00.9s/3m30.0s

running (2m01.9s), 250/250 VUs, 1746 complete and 0 interrupted iterations
default   [  58% ] 250/250 VUs  2m01.9s/3m30.0s

running (2m02.9s), 250/250 VUs, 1759 complete and 0 interrupted iterations
default   [  59% ] 250/250 VUs  2m02.9s/3m30.0s

running (2m03.9s), 250/250 VUs, 1779 complete and 0 interrupted iterations
default   [  59% ] 250/250 VUs  2m03.9s/3m30.0s

running (2m04.9s), 250/250 VUs, 1801 complete and 0 interrupted iterations
default   [  59% ] 250/250 VUs  2m04.9s/3m30.0s

running (2m05.9s), 250/250 VUs, 1824 complete and 0 interrupted iterations
default   [  60% ] 250/250 VUs  2m05.9s/3m30.0s

running (2m06.9s), 250/250 VUs, 1840 complete and 0 interrupted iterations
default   [  60% ] 250/250 VUs  2m06.9s/3m30.0s

running (2m07.9s), 250/250 VUs, 1859 complete and 0 interrupted iterations
default   [  61% ] 250/250 VUs  2m07.9s/3m30.0s

running (2m08.9s), 250/250 VUs, 1879 complete and 0 interrupted iterations
default   [  61% ] 250/250 VUs  2m08.9s/3m30.0s

running (2m09.9s), 250/250 VUs, 1897 complete and 0 interrupted iterations
default   [  62% ] 250/250 VUs  2m09.9s/3m30.0s

running (2m10.9s), 250/250 VUs, 1919 complete and 0 interrupted iterations
default   [  62% ] 250/250 VUs  2m10.9s/3m30.0s

running (2m11.9s), 250/250 VUs, 1947 complete and 0 interrupted iterations
default   [  63% ] 250/250 VUs  2m11.9s/3m30.0s

running (2m12.9s), 250/250 VUs, 1972 complete and 0 interrupted iterations
default   [  63% ] 250/250 VUs  2m12.9s/3m30.0s

running (2m13.9s), 250/250 VUs, 1996 complete and 0 interrupted iterations
default   [  64% ] 250/250 VUs  2m13.9s/3m30.0s

running (2m14.9s), 250/250 VUs, 2022 complete and 0 interrupted iterations
default   [  64% ] 250/250 VUs  2m14.9s/3m30.0s

running (2m15.9s), 250/250 VUs, 2036 complete and 0 interrupted iterations
default   [  65% ] 250/250 VUs  2m15.9s/3m30.0s

running (2m16.9s), 250/250 VUs, 2053 complete and 0 interrupted iterations
default   [  65% ] 250/250 VUs  2m16.9s/3m30.0s

running (2m17.9s), 250/250 VUs, 2074 complete and 0 interrupted iterations
default   [  66% ] 250/250 VUs  2m17.9s/3m30.0s

running (2m18.9s), 250/250 VUs, 2100 complete and 0 interrupted iterations
default   [  66% ] 250/250 VUs  2m18.9s/3m30.0s

running (2m19.9s), 250/250 VUs, 2125 complete and 0 interrupted iterations
default   [  67% ] 250/250 VUs  2m19.9s/3m30.0s

running (2m20.9s), 250/250 VUs, 2143 complete and 0 interrupted iterations
default   [  67% ] 250/250 VUs  2m20.9s/3m30.0s

running (2m21.9s), 250/250 VUs, 2163 complete and 0 interrupted iterations
default   [  68% ] 250/250 VUs  2m21.9s/3m30.0s

running (2m22.9s), 250/250 VUs, 2183 complete and 0 interrupted iterations
default   [  68% ] 250/250 VUs  2m22.9s/3m30.0s

running (2m23.9s), 250/250 VUs, 2198 complete and 0 interrupted iterations
default   [  69% ] 250/250 VUs  2m23.9s/3m30.0s

running (2m24.9s), 250/250 VUs, 2219 complete and 0 interrupted iterations
default   [  69% ] 250/250 VUs  2m24.9s/3m30.0s

running (2m25.9s), 250/250 VUs, 2245 complete and 0 interrupted iterations
default   [  69% ] 250/250 VUs  2m25.9s/3m30.0s

running (2m26.9s), 250/250 VUs, 2276 complete and 0 interrupted iterations
default   [  70% ] 250/250 VUs  2m26.9s/3m30.0s

running (2m27.9s), 250/250 VUs, 2307 complete and 0 interrupted iterations
default   [  70% ] 250/250 VUs  2m27.9s/3m30.0s

running (2m28.9s), 250/250 VUs, 2330 complete and 0 interrupted iterations
default   [  71% ] 250/250 VUs  2m28.9s/3m30.0s

running (2m29.9s), 250/250 VUs, 2357 complete and 0 interrupted iterations
default   [  71% ] 250/250 VUs  2m29.9s/3m30.0s

running (2m30.9s), 250/250 VUs, 2376 complete and 0 interrupted iterations
default   [  72% ] 250/250 VUs  2m30.9s/3m30.0s

running (2m31.9s), 250/250 VUs, 2401 complete and 0 interrupted iterations
default   [  72% ] 250/250 VUs  2m31.9s/3m30.0s

running (2m32.9s), 250/250 VUs, 2428 complete and 0 interrupted iterations
default   [  73% ] 250/250 VUs  2m32.9s/3m30.0s

running (2m33.9s), 250/250 VUs, 2446 complete and 0 interrupted iterations
default   [  73% ] 250/250 VUs  2m33.9s/3m30.0s

running (2m34.9s), 250/250 VUs, 2465 complete and 0 interrupted iterations
default   [  74% ] 250/250 VUs  2m34.9s/3m30.0s

running (2m35.9s), 250/250 VUs, 2490 complete and 0 interrupted iterations
default   [  74% ] 250/250 VUs  2m35.9s/3m30.0s

running (2m36.9s), 250/250 VUs, 2514 complete and 0 interrupted iterations
default   [  75% ] 250/250 VUs  2m36.9s/3m30.0s

running (2m37.9s), 250/250 VUs, 2543 complete and 0 interrupted iterations
default   [  75% ] 250/250 VUs  2m37.9s/3m30.0s

running (2m38.9s), 250/250 VUs, 2570 complete and 0 interrupted iterations
default   [  76% ] 250/250 VUs  2m38.9s/3m30.0s

running (2m39.9s), 250/250 VUs, 2596 complete and 0 interrupted iterations
default   [  76% ] 250/250 VUs  2m39.9s/3m30.0s

running (2m40.9s), 250/250 VUs, 2615 complete and 0 interrupted iterations
default   [  77% ] 250/250 VUs  2m40.9s/3m30.0s

running (2m41.9s), 250/250 VUs, 2639 complete and 0 interrupted iterations
default   [  77% ] 250/250 VUs  2m41.9s/3m30.0s

running (2m42.9s), 250/250 VUs, 2665 complete and 0 interrupted iterations
default   [  78% ] 250/250 VUs  2m42.9s/3m30.0s

running (2m43.9s), 250/250 VUs, 2685 complete and 0 interrupted iterations
default   [  78% ] 250/250 VUs  2m43.9s/3m30.0s

running (2m44.9s), 250/250 VUs, 2716 complete and 0 interrupted iterations
default   [  79% ] 250/250 VUs  2m44.9s/3m30.0s

running (2m45.9s), 250/250 VUs, 2749 complete and 0 interrupted iterations
default   [  79% ] 250/250 VUs  2m45.9s/3m30.0s

running (2m46.9s), 250/250 VUs, 2775 complete and 0 interrupted iterations
default   [  79% ] 250/250 VUs  2m46.9s/3m30.0s

running (2m47.9s), 250/250 VUs, 2801 complete and 0 interrupted iterations
default   [  80% ] 250/250 VUs  2m47.9s/3m30.0s

running (2m48.9s), 250/250 VUs, 2824 complete and 0 interrupted iterations
default   [  80% ] 250/250 VUs  2m48.9s/3m30.0s

running (2m49.9s), 250/250 VUs, 2837 complete and 0 interrupted iterations
default   [  81% ] 250/250 VUs  2m49.9s/3m30.0s

running (2m50.9s), 250/250 VUs, 2844 complete and 0 interrupted iterations
default   [  81% ] 250/250 VUs  2m50.9s/3m30.0s

running (2m51.9s), 250/250 VUs, 2844 complete and 0 interrupted iterations
default   [  82% ] 250/250 VUs  2m51.9s/3m30.0s

running (2m52.9s), 250/250 VUs, 2851 complete and 0 interrupted iterations
default   [  82% ] 250/250 VUs  2m52.9s/3m30.0s

running (2m53.9s), 250/250 VUs, 2866 complete and 0 interrupted iterations
default   [  83% ] 250/250 VUs  2m53.9s/3m30.0s

running (2m54.9s), 250/250 VUs, 2880 complete and 0 interrupted iterations
default   [  83% ] 250/250 VUs  2m54.9s/3m30.0s

running (2m55.9s), 250/250 VUs, 2904 complete and 0 interrupted iterations
default   [  84% ] 250/250 VUs  2m55.9s/3m30.0s

running (2m56.9s), 250/250 VUs, 2920 complete and 0 interrupted iterations
default   [  84% ] 250/250 VUs  2m56.9s/3m30.0s

running (2m57.9s), 250/250 VUs, 2934 complete and 0 interrupted iterations
default   [  85% ] 250/250 VUs  2m57.9s/3m30.0s

running (2m58.9s), 250/250 VUs, 2943 complete and 0 interrupted iterations
default   [  85% ] 250/250 VUs  2m58.9s/3m30.0s

running (2m59.9s), 250/250 VUs, 2949 complete and 0 interrupted iterations
default   [  86% ] 250/250 VUs  2m59.9s/3m30.0s

running (3m00.9s), 250/250 VUs, 2956 complete and 0 interrupted iterations
default   [  86% ] 250/250 VUs  3m00.9s/3m30.0s

running (3m01.9s), 250/250 VUs, 2969 complete and 0 interrupted iterations
default   [  87% ] 250/250 VUs  3m01.9s/3m30.0s

running (3m02.9s), 248/250 VUs, 2999 complete and 0 interrupted iterations
default   [  87% ] 248/250 VUs  3m02.9s/3m30.0s

running (3m03.9s), 245/250 VUs, 3022 complete and 0 interrupted iterations
default   [  88% ] 245/250 VUs  3m03.9s/3m30.0s

running (3m04.9s), 239/250 VUs, 3045 complete and 0 interrupted iterations
default   [  88% ] 239/250 VUs  3m04.9s/3m30.0s

running (3m05.9s), 233/250 VUs, 3064 complete and 0 interrupted iterations
default   [  89% ] 233/250 VUs  3m05.9s/3m30.0s

running (3m06.9s), 226/250 VUs, 3085 complete and 0 interrupted iterations
default   [  89% ] 226/250 VUs  3m06.9s/3m30.0s

running (3m07.9s), 221/250 VUs, 3104 complete and 0 interrupted iterations
default   [  89% ] 221/250 VUs  3m07.9s/3m30.0s

running (3m08.9s), 213/250 VUs, 3129 complete and 0 interrupted iterations
default   [  90% ] 213/250 VUs  3m08.9s/3m30.0s

running (3m09.9s), 208/250 VUs, 3147 complete and 0 interrupted iterations
default   [  90% ] 208/250 VUs  3m09.9s/3m30.0s

running (3m10.9s), 202/250 VUs, 3166 complete and 0 interrupted iterations
default   [  91% ] 202/250 VUs  3m10.9s/3m30.0s

running (3m11.9s), 200/250 VUs, 3182 complete and 0 interrupted iterations
default   [  91% ] 200/250 VUs  3m11.9s/3m30.0s

running (3m12.9s), 192/250 VUs, 3201 complete and 0 interrupted iterations
default   [  92% ] 192/250 VUs  3m12.9s/3m30.0s

running (3m13.9s), 185/250 VUs, 3225 complete and 0 interrupted iterations
default   [  92% ] 185/250 VUs  3m13.9s/3m30.0s

running (3m14.9s), 176/250 VUs, 3252 complete and 0 interrupted iterations
default   [  93% ] 176/250 VUs  3m14.9s/3m30.0s

running (3m15.9s), 162/250 VUs, 3278 complete and 0 interrupted iterations
default   [  93% ] 162/250 VUs  3m15.9s/3m30.0s

running (3m16.9s), 155/250 VUs, 3297 complete and 0 interrupted iterations
default   [  94% ] 155/250 VUs  3m16.9s/3m30.0s

running (3m17.9s), 150/250 VUs, 3318 complete and 0 interrupted iterations
default   [  94% ] 150/250 VUs  3m17.9s/3m30.0s

running (3m18.9s), 141/250 VUs, 3339 complete and 0 interrupted iterations
default   [  95% ] 141/250 VUs  3m18.9s/3m30.0s

running (3m19.9s), 130/250 VUs, 3359 complete and 0 interrupted iterations
default   [  95% ] 130/250 VUs  3m19.9s/3m30.0s

running (3m20.9s), 123/250 VUs, 3368 complete and 0 interrupted iterations
default   [  96% ] 123/250 VUs  3m20.9s/3m30.0s

running (3m21.9s), 116/250 VUs, 3384 complete and 0 interrupted iterations
default   [  96% ] 116/250 VUs  3m21.9s/3m30.0s

running (3m22.9s), 106/250 VUs, 3400 complete and 0 interrupted iterations
default   [  97% ] 106/250 VUs  3m22.9s/3m30.0s

running (3m23.9s), 098/250 VUs, 3414 complete and 0 interrupted iterations
default   [  97% ] 098/250 VUs  3m23.9s/3m30.0s

running (3m24.9s), 088/250 VUs, 3433 complete and 0 interrupted iterations
default   [  98% ] 088/250 VUs  3m24.9s/3m30.0s

running (3m25.9s), 085/250 VUs, 3442 complete and 0 interrupted iterations
default   [  98% ] 085/250 VUs  3m25.9s/3m30.0s

running (3m26.9s), 077/250 VUs, 3453 complete and 0 interrupted iterations
default   [  99% ] 077/250 VUs  3m26.9s/3m30.0s

running (3m27.9s), 068/250 VUs, 3464 complete and 0 interrupted iterations
default   [  99% ] 068/250 VUs  3m27.9s/3m30.0s

running (3m28.9s), 056/250 VUs, 3480 complete and 0 interrupted iterations
default   [  99% ] 056/250 VUs  3m28.9s/3m30.0s

running (3m29.9s), 047/250 VUs, 3490 complete and 0 interrupted iterations
default   [ 100% ] 047/250 VUs  3m29.9s/3m30.0s

running (3m30.9s), 041/250 VUs, 3496 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m31.9s), 032/250 VUs, 3505 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m32.9s), 024/250 VUs, 3513 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m33.9s), 023/250 VUs, 3514 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m34.9s), 018/250 VUs, 3519 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m35.9s), 013/250 VUs, 3524 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m36.9s), 009/250 VUs, 3528 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m37.9s), 007/250 VUs, 3530 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m38.9s), 005/250 VUs, 3532 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m39.9s), 004/250 VUs, 3533 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m40.9s), 003/250 VUs, 3534 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m41.9s), 002/250 VUs, 3535 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m42.9s), 001/250 VUs, 3536 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s

running (3m43.9s), 001/250 VUs, 3536 complete and 0 interrupted iterations
default ↓ [ 100% ] 047/250 VUs  3m30s


  █ THRESHOLDS 

    http_req_duration{group:::categoria}
    ✗ 'p(95)<1500' p(95)=3.81s
    ✗ 'p(99)<2500' p(99)=5.9s

    http_req_duration{group:::categorias_listado}
    ✗ 'p(95)<1200' p(95)=3.89s
    ✗ 'p(99)<2000' p(99)=5.23s

    http_req_duration{group:::checkout_shell}
    ✗ 'p(95)<1500' p(95)=3.45s
    ✗ 'p(99)<2500' p(99)=5.07s

    http_req_duration{group:::home}
    ✗ 'p(95)<1500' p(95)=3.95s
    ✗ 'p(99)<2500' p(99)=5.8s

    http_req_duration{group:::listado_productos}
    ✗ 'p(95)<1500' p(95)=4.07s
    ✗ 'p(99)<2500' p(99)=5.93s

    http_req_duration{group:::paginas_estaticas}
    ✗ 'p(95)<800' p(95)=3.4s
    ✗ 'p(99)<1500' p(99)=5.36s

    http_req_duration{group:::producto}
    ✗ 'p(95)<1200' p(95)=4.01s
    ✗ 'p(99)<2000' p(99)=5.72s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    solicitudes_a_rutas_prohibidas
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 35736   159.149594/s
    checks_succeeded...: 100.00% 35736 out of 35736
    checks_failed......: 0.00%   0 out of 35736

    ✓ status es 200
    ✓ no es 5xx
    ✓ respuesta no vacía

    CUSTOM
    cliente_descarga...................: avg=529.55ms min=554.79µs med=246.49ms max=12.72s p(90)=1.16s  p(95)=2.32s  p(99)=4.55s   
    cliente_dns_bloqueo................: avg=13.14ms  min=0s       med=0s       max=5.2s   p(90)=0s     p(95)=0s     p(99)=294.38ms
    cliente_tcp_conexion...............: avg=5.58ms   min=0s       med=0s       max=2.16s  p(90)=0s     p(95)=0s     p(99)=114.07ms
    cliente_tiempo_total...............: avg=1.13s    min=87.59ms  med=740.53ms max=13.54s p(90)=2.73s  p(95)=3.94s  p(99)=5.79s   
    cliente_tls_handshake..............: avg=7.55ms   min=0s       med=0s       max=4.6s   p(90)=0s     p(95)=0s     p(99)=195.63ms
    cliente_ttfb_espera................: avg=601.1ms  min=63.99ms  med=431.32ms max=6.7s   p(90)=1.24s  p(95)=1.79s  p(99)=3.17s   
    http_estado_2xx....................: 11912  53.049865/s
    solicitudes_a_rutas_prohibidas.....: 0      0/s
    vercel_cache_hit...................: 11777  52.448645/s
    vercel_cache_hit_categoria.........: 1573   7.005325/s
    vercel_cache_hit_categorias........: 743    3.308936/s
    vercel_cache_hit_checkout..........: 263    1.171265/s
    vercel_cache_hit_home..............: 3530   15.720788/s
    vercel_cache_hit_producto..........: 2849   12.687967/s
    vercel_cache_hit_products..........: 2480   11.044633/s
    vercel_cache_miss..................: 135    0.60122/s
    vercel_cache_miss_categoria........: 12     0.053442/s
    vercel_cache_miss_categorias.......: 1      0.004453/s
    vercel_cache_miss_checkout.........: 1      0.004453/s
    vercel_cache_miss_home.............: 7      0.031174/s
    vercel_cache_miss_producto.........: 109    0.485429/s
    vercel_cache_miss_products.........: 1      0.004453/s

    HTTP
    http_req_duration..................: avg=1.13s    min=87.59ms  med=740.53ms max=13.54s p(90)=2.73s  p(95)=3.94s  p(99)=5.79s   
      { expected_response:true }.......: avg=1.13s    min=87.59ms  med=740.53ms max=13.54s p(90)=2.73s  p(95)=3.94s  p(99)=5.79s   
      { group:::categoria }............: avg=1.1s     min=91.07ms  med=702.81ms max=13.54s p(90)=2.6s   p(95)=3.81s  p(99)=5.9s    
      { group:::categorias_listado }...: avg=1.05s    min=87.59ms  med=704.91ms max=6.05s  p(90)=2.48s  p(95)=3.89s  p(99)=5.23s   
      { group:::checkout_shell }.......: avg=1.06s    min=107.13ms med=696.23ms max=6.9s   p(90)=2.53s  p(95)=3.45s  p(99)=5.07s   
      { group:::home }.................: avg=1.14s    min=88.16ms  med=752.02ms max=8.45s  p(90)=2.73s  p(95)=3.95s  p(99)=5.8s    
      { group:::listado_productos }....: avg=1.17s    min=95.25ms  med=776.24ms max=12.77s p(90)=3.03s  p(95)=4.07s  p(99)=5.93s   
      { group:::paginas_estaticas }....: avg=1.02s    min=98.06ms  med=717.56ms max=6.39s  p(90)=2.17s  p(95)=3.4s   p(99)=5.36s   
      { group:::producto }.............: avg=1.12s    min=90.88ms  med=734.44ms max=13.51s p(90)=2.79s  p(95)=4.01s  p(99)=5.72s   
    http_req_failed....................: 0.00%  0 out of 11912
    http_reqs..........................: 11912  53.049865/s

    EXECUTION
    iteration_duration.................: avg=12.06s   min=1.25s    med=11.49s   max=34.96s p(90)=19.07s p(95)=21.37s p(99)=25.93s  
    iterations.........................: 3537   15.751962/s
    vus................................: 1      min=1          max=250
    vus_max............................: 250    min=250        max=250

    NETWORK
    data_received......................: 541 MB 2.4 MB/s
    data_sent..........................: 2.6 MB 12 kB/s



running (3m44.5s), 000/250 VUs, 3537 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/250 VUs  3m30s
time="2026-09-17T08:34:04-04:00" level=error msg="thresholds on metrics 'http_req_duration{group:::categorias_listado}, http_req_duration{group:::categoria}, http_req_duration{group:::checkout_shell}, http_req_duration{group:::home}, http_req_duration{group:::listado_productos}, http_req_duration{group:::paginas_estaticas}, http_req_duration{group:::producto}' have been crossed"